level_prise_data = {
    "求道者": {
        "易": {
            "level": "易",
            "award": 20,
            "needexp": 100,
            "time": 6
        }
    },
    "炼体境": {
        "易": {
            "level": "易",
            "award": 100,
            "needexp": 1000,
            "time": 6
        },
        "中": {
            "level": "中",
            "award": 200,
            "needexp": 2000,
            "time": 12
        }
    },
    "感气境": {
        "易": {
            "level": "易",
            "award": 300,
            "needexp": 30000,
            "time": 6
        },
        "中": {
            "level": "中",
            "award": 450,
            "needexp": 45000,
            "time": 12
        }
    },
    "引气境": {
        "易": {
            "level": "易",
            "award": 1000,
            "needexp": 100000,
            "time": 6
        },
        "中": {
            "level": "中",
            "award": 1200,
            "needexp": 120000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 1400,
            "needexp": 140000,
            "time": 18
        }
    },
    "凝气境": {
        "易": {
            "level": "易",
            "award": 1800,
            "needexp": 180000,
            "time": 6
        },
        "中": {
            "level": "中",
            "award": 2700,
            "needexp": 270000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 3700,
            "needexp": 370000,
            "time": 18
        }
    },
    "聚元境": {
        "中": {
            "level": "中",
            "award": 8000,
            "needexp": 800000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 20600,
            "needexp": 2060000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 39000,
            "needexp": 3900000,
            "time": 24
        }
    },
    "归元境": {
        "中": {
            "level": "中",
            "award": 95800,
            "needexp": 9580000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 298000,
            "needexp": 29800000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 627800,
            "needexp": 62780000,
            "time": 24
        }
    },
    "通玄境": {
        "中": {
            "level": "中",
            "award": 1248800,
            "needexp": 124880000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 2880000,
            "needexp": 288000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 10988000,
            "needexp": 1098800000,
            "time": 24
        }
    },
    "踏虚境": {
        "中": {
            "level": "中",
            "award": 50688800,
            "needexp": 5068880000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 70108880,
            "needexp": 7010888000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 98888000,
            "needexp": 9888800000,
            "time": 24
        }
    },
    "天人境": {
        "中": {
            "level": "中",
            "award": 168888000,
            "needexp": 16888800000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 198888000,
            "needexp": 19888800000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 228888000,
            "needexp": 22888800000,
            "time": 24
        }
    },
    "悟道境": {
        "中": {
            "level": "中",
            "award": 550000000,
            "needexp": 100000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 750000000,
            "needexp": 150000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 950000000,
            "needexp": 200000000000,
            "time": 24
        }
    },
    "炼神境": {
        "中": {
            "level": "中",
            "award": 1500000000,
            "needexp": 750000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 2000000000,
            "needexp": 900000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 2500000000,
            "needexp": 1000000000000,
            "time": 24
        }
    },
    "逆虚境": {
        "中": {
            "level": "中",
            "award": 3000000000,
            "needexp": 1500000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 3500000000,
            "needexp": 1750000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 4000000000,
            "needexp": 2000000000000,
            "time": 24
        }
    },
    "合道境": {
        "中": {
            "level": "中",
            "award": 4500000000,
            "needexp": 3200000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 5000000000,
            "needexp": 3600000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 6000000000,
            "needexp": 4200000000000,
            "time": 24
        }
    },
    "虚劫境": {
        "中": {
            "level": "中",
            "award": 6500000000,
            "needexp": 8000000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 7500000000,
            "needexp": 9500000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 9000000000,
            "needexp": 11000000000000,
            "time": 24
        }
    },
    "羽化境": {
        "中": {
            "level": "中",
            "award": 10000000000,
            "needexp": 20000000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 11000000000,
            "needexp": 28000000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 12500000000,
            "needexp": 36000000000000,
            "time": 24
        }
    },
    "登仙境": {
        "中": {
            "level": "中",
            "award": 15000000000,
            "needexp": 105000000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 16500000000,
            "needexp": 120000000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 18000000000,
            "needexp": 135000000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 20000000000,
            "needexp": 150000000000000,
            "time": 60
        }
    },
    "凡仙境": {
        "中": {
            "level": "中",
            "award": 21000000000,
            "needexp": 200000000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 23500000000,
            "needexp": 225000000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 26000000000,
            "needexp": 255000000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 30000000000,
            "needexp": 280000000000000,
            "time": 60
        }
    },
    "地仙境": {
        "中": {
            "level": "中",
            "award": 35000000000,
            "needexp": 360000000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 42000000000,
            "needexp": 420000000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 50000000000,
            "needexp": 480000000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 65000000000,
            "needexp": 540000000000000,
            "time": 60
        }
    },
    "玄仙境": {
        "中": {
            "level": "中",
            "award": 75000000000,
            "needexp": 700000000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 90000000000,
            "needexp": 800000000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 110000000000,
            "needexp": 950000000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 150000000000,
            "needexp": 1100000000000000,
            "time": 60
        }
    },
    "金仙境": {
        "中": {
            "level": "中",
            "award": 160000000000,
            "needexp": 1500000000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 200000000000,
            "needexp": 2000000000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 250000000000,
            "needexp": 2500000000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 350000000000,
            "needexp": 3000000000000000,
            "time": 60
        }
    },
    "仙帝境": {
        "中": {
            "level": "中",
            "award": 400000000000,
            "needexp": 5000000000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 500000000000,
            "needexp": 6000000000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 600000000000,
            "needexp": 8500000000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 750000000000,
            "needexp": 11500000000000000,
            "time": 60
        }
    },
    "准圣境": {
        "中": {
            "level": "中",
            "award": 3000000000000,
            "needexp": 80000000000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 3500000000000,
            "needexp": 95000000000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 4000000000000,
            "needexp": 110000000000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 5000000000000,
            "needexp": 1250000000000000000,
            "time": 60
        }
    },
    "圣人境": {
        "中": {
            "level": "中",
            "award": 6000000000000,
            "needexp": 160000000000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 8000000000000,
            "needexp": 200000000000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 12000000000000,
            "needexp": 240000000000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 18000000000000,
            "needexp": 300000000000000000,
            "time": 60
        }
    },
    "大圣境": {
        "中": {
            "level": "中",
            "award": 25000000000000,
            "needexp": 500000000000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 35000000000000,
            "needexp": 600000000000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 45000000000000,
            "needexp": 700000000000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 60000000000000,
            "needexp": 850000000000000000,
            "time": 60
        }
    },
    "圣王境": {
        "中": {
            "level": "中",
            "award": 75000000000000,
            "needexp": 1300000000000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 90000000000000,
            "needexp": 1500000000000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 105000000000000,
            "needexp": 1700000000000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 135000000000000,
            "needexp": 1900000000000000000,
            "time": 60
        }
    },
    "不可言": {
        "中": {
            "level": "中",
            "award": 150000000000000,
            "needexp": 3500000000000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 175000000000000,
            "needexp": 4500000000000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 200000000000000,
            "needexp": 5500000000000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 240000000000000,
            "needexp": 6500000000000000000,
            "time": 60
        }
    },
    "道神境": {
        "中": {
            "level": "中",
            "award": 16000000000,
            "needexp": 90000000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 18000000000,
            "needexp": 110000000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 20000000000,
            "needexp": 130000000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 24000000000,
            "needexp": 150000000000000,
            "time": 60
        }
    },
    "道无涯": {
        "中": {
            "level": "中",
            "award": 27000000000,
            "needexp": 270000000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 30000000000,
            "needexp": 300000000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 36000000000,
            "needexp": 360000000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 42000000000,
            "needexp": 420000000000000,
            "time": 60
        }
    }
}
