level_prise_data = {
    "求道者": {
        "易": {
            "level": "易",
            "award": 20,
            "needexp": 100,
            "time": 6
        }
    },
    "炼体境": {
        "易": {
            "level": "易",
            "award": 100,
            "needexp": 1000,
            "time": 6
        },
        "中": {
            "level": "中",
            "award": 200,
            "needexp": 1000,
            "time": 12
        }
    },
    "感气境": {
        "易": {
            "level": "易",
            "award": 300,
            "needexp": 30000,
            "time": 6
        },
        "中": {
            "level": "中",
            "award": 450,
            "needexp": 30000,
            "time": 12
        }
    },
    "引气境": {
        "易": {
            "level": "易",
            "award": 1000,
            "needexp": 100000,
            "time": 6
        },
        "中": {
            "level": "中",
            "award": 1200,
            "needexp": 120000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 1400,
            "needexp": 140000,
            "time": 18
        }
    },
    "凝气境": {
        "易": {
            "level": "易",
            "award": 1800,
            "needexp": 180000,
            "time": 6
        },
        "中": {
            "level": "中",
            "award": 2700,
            "needexp": 180000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 3700,
            "needexp": 270000,
            "time": 18
        }
    },
    "聚元境": {
        "中": {
            "level": "中",
            "award": 8000,
            "needexp": 800000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 20600,
            "needexp": 800000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 39000,
            "needexp": 660000,
            "time": 24
        }
    },
    "归元境": {
        "中": {
            "level": "中",
            "award": 95800,
            "needexp": 9580000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 298000,
            "needexp": 9580000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 627800,
            "needexp": 29800000,
            "time": 24
        }
    },
    "通玄境": {
        "中": {
            "level": "中",
            "award": 1248800,
            "needexp": 124880000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 2880000,
            "needexp": 124880000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 10988000,
            "needexp": 288000000,
            "time": 24
        }
    },
    "踏虚境": {
        "中": {
            "level": "中",
            "award": 50688800,
            "needexp": 5068880000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 70108880,
            "needexp": 5068880000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 98888000,
            "needexp": 7010888000,
            "time": 24
        }
    },
    "天人境": {
        "中": {
            "level": "中",
            "award": 168888000,
            "needexp": 16888800000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 198888000,
            "needexp": 16888800000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 228888000,
            "needexp": 44833200000,
            "time": 24
        }
    },
    "悟道境": {
        "中": {
            "level": "中",
            "award": 550000000,
            "needexp": 134499600000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 750000000,
            "needexp": 134499600000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 950000000,
            "needexp": 268999200000,
            "time": 24
        }
    },
    "炼神境": {
        "中": {
            "level": "中",
            "award": 1500000000,
            "needexp": 847347480000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 2000000000,
            "needexp": 847347480000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 2500000000,
            "needexp": 1016816976000,
            "time": 24
        }
    },
    "逆虚境": {
        "中": {
            "level": "中",
            "award": 3000000000,
            "needexp": 1586234482000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 3500000000,
            "needexp": 1586234482000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 4000000000,
            "needexp": 1903481378000,
            "time": 24
        }
    },
    "合道境": {
        "中": {
            "level": "中",
            "award": 4500000000,
            "needexp": 3426266481000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 5000000000,
            "needexp": 3426266481000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 6000000000,
            "needexp": 4111519777000,
            "time": 24
        }
    },
    "虚劫境": {
        "中": {
            "level": "中",
            "award": 6500000000,
            "needexp": 8017463565000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 7500000000,
            "needexp": 8017463565000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 9000000000,
            "needexp": 10422702630000,
            "time": 24
        }
    },
    "羽化境": {
        "中": {
            "level": "中",
            "award": 10000000000,
            "needexp": 24217123420000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 11000000000,
            "needexp": 24217123420000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 12500000000,
            "needexp": 42384513420000,
            "time": 24
        }
    },
    "登仙境": {
        "中": {
            "level": "中",
            "award": 13500000000,
            "needexp": 109184274620000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 14000000000,
            "needexp": 124927000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 14500000000,
            "needexp": 152208000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 15500000000,
            "needexp": 205482000000000,
            "time": 60
        }
    },
    "真仙境": {
        "中": {
            "level": "中",
            "award": 15500000000,
            "needexp": 289105000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 16000000000,
            "needexp": 320135000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 17200000000,
            "needexp": 354664000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 18600000000,
            "needexp": 433291000000000,
            "time": 60
        }
    },
    "玄仙境": {
        "中": {
            "level": "中",
            "award": 19100000000,
            "needexp": 544251000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 21100000000,
            "needexp": 601725000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 21900000000,
            "needexp": 664126000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 23100000000,
            "needexp": 812141000000000,
            "time": 60
        }
    },
    "金仙境": {
        "中": {
            "level": "中",
            "award": 25500000000,
            "needexp": 1005676000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 28000000000,
            "needexp": 1096131000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 30000000000,
            "needexp": 1196153000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 33700000000,
            "needexp": 1425970000000000,
            "time": 60
        }
    },
    "太乙金": {
        "中": {
            "level": "中",
            "award": 50100000000,
            "needexp": 1736080000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 65900000000,
            "needexp": 1898880000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 75300000000,
            "needexp": 2080070000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 86700000000,
            "needexp": 2530720000000000,
            "time": 60
        }
    },
    "大罗金": {
        "中": {
            "level": "中",
            "award": 166000000000,
            "needexp": 3211180000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 215000000000,
            "needexp": 3595240000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 375000000000,
            "needexp": 4093460000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 451000000000,
            "needexp": 5584520000000000,
            "time": 60
        }
    },
    "九天玄": {
        "中": {
            "level": "中",
            "award": 654000000000,
            "needexp": 8243710000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 722000000000,
            "needexp": 9722030000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 793000000000,
            "needexp": 11364300000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 873000000000,
            "needexp": 15181900000000000,
            "time": 60
        }
    },
    "混元大": {
        "中": {
            "level": "中",
            "award": 1050000000000,
            "needexp": 20469900000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 1160000000000,
            "needexp": 23207800000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 1280000000000,
            "needexp": 26202200000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 1400000000000,
            "needexp": 33177400000000000,
            "time": 60
        }
    },
    "罗天上": {
        "中": {
            "level": "中",
            "award": 1410000000000,
            "needexp": 43338800000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 1690000000000,
            "needexp": 48822400000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 1870000000000,
            "needexp": 54883100000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 21600000000000,
            "needexp": 68896500000000000,
            "time": 60
        }
    },
    "无上仙": {
        "中": {
            "level": "中",
            "award": 24500000000000,
            "needexp": 87821300000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 27600000000000,
            "needexp": 97658300000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 35000000000000,
            "needexp": 108074000000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 49300000000000,
            "needexp": 131587000000000000,
            "time": 60
        }
    },
    "混沌仙": {
        "中": {
            "level": "中",
            "award": 56200000000000,
            "needexp": 166253000000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 63800000000000,
            "needexp": 184745000000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 81700000000000,
            "needexp": 205232000000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 103000000000000,
            "needexp": 252589000000000000,
            "time": 60
        }
    },
    "无极仙": {
        "中": {
            "level": "中",
            "award": 116000000000000,
            "needexp": 323375000000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 128000000000000,
            "needexp": 357571000000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 155000000000000,
            "needexp": 395288000000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 187000000000000,
            "needexp": 482085000000000000,
            "time": 60
        }
    },
    "神君境": {
        "中": {
            "level": "中",
            "award": 210000000000000,
            "needexp": 669251000000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 230000000000000,
            "needexp": 772064000000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 278000000000000,
            "needexp": 884942000000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 336000000000000,
            "needexp": 1142377000000000000,
            "time": 60
        }
    },
    "神王境": {
        "中": {
            "level": "中",
            "award": 376000000000000,
            "needexp": 1544740000000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 412000000000000,
            "needexp": 1725740000000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 497000000000000,
            "needexp": 1931490000000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 600000000000000,
            "needexp": 2395640000000000000,
            "time": 60
        }
    },
    "神皇境": {
        "中": {
            "level": "中",
            "award": 670000000000000,
            "needexp": 3121850000000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 807000000000000,
            "needexp": 3443480000000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 973000000000000,
            "needexp": 3794150000000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 1070000000000000,
            "needexp": 4610450000000000000,
            "time": 60
        }
    },
    "神帝境": {
        "中": {
            "level": "中",
            "award": 1190000000000000,
            "needexp": 5889950000000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 1490000000000000,
            "needexp": 6449770000000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 1730000000000000,
            "needexp": 7073340000000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 1900000000000000,
            "needexp": 8505560000000000000,
            "time": 60
        }
    },
    "神尊境": {
        "中": {
            "level": "中",
            "award": 2120000000000000,
            "needexp": 10777000000000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 2370000000000000,
            "needexp": 11789870000000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 245377000000000,
            "needexp": 12887450000000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 269468000000000,
            "needexp": 15594560000000000000,
            "time": 60
        }
    },
    "无上至": {
        "中": {
            "level": "中",
            "award": 297538000000000,
            "needexp": 19808900000000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 327314000000000,
            "needexp": 21679400000000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 435627000000000,
            "needexp": 23740200000000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 479221000000000,
            "needexp": 28557900000000000000,
            "time": 60
        }
    },
    "鸿蒙掌": {
        "中": {
            "level": "中",
            "award": 527144000000000,
            "needexp": 36042300000000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 621718000000000,
            "needexp": 39289900000000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 771718000000000,
            "needexp": 42892200000000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 847326000000000,
            "needexp": 51454800000000000000,
            "time": 60
        }
    },
    "道神境": {
        "中": {
            "level": "中",
            "award": 933833000000000,
            "needexp": 64976700000000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 1129940000000000,
            "needexp": 71223300000000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 1503900000000000,
            "needexp": 85555500000000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 1819780000000000,
            "needexp": 112907500000000000000,
            "time": 60
        }
    },
    "道无涯": {
        "中": {
            "level": "中",
            "award": 2001820000000000,
            "needexp": 156174000000000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 2202010000000000,
            "needexp": 173300000000000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 2930680000000000,
            "needexp": 192211000000000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 3223960000000000,
            "needexp": 235576600000000000000,
            "time": 60
        }
    }
}