level_prise_data = {
    "求道者": {
        "易": {
            "level": "易",
            "award": 20,
            "needexp": 100,
            "time": 6
        }
    },
    "炼体境": {
        "易": {
            "level": "易",
            "award": 100,
            "needexp": 1000,
            "time": 6
        },
        "中": {
            "level": "中",
            "award": 200,
            "needexp": 2000,
            "time": 12
        }
    },
    "感气境": {
        "易": {
            "level": "易",
            "award": 300,
            "needexp": 30000,
            "time": 6
        },
        "中": {
            "level": "中",
            "award": 450,
            "needexp": 45000,
            "time": 12
        }
    },
    "引气境": {
        "易": {
            "level": "易",
            "award": 1000,
            "needexp": 100000,
            "time": 6
        },
        "中": {
            "level": "中",
            "award": 1200,
            "needexp": 120000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 1400,
            "needexp": 140000,
            "time": 18
        }
    },
    "凝气境": {
        "易": {
            "level": "易",
            "award": 1800,
            "needexp": 180000,
            "time": 6
        },
        "中": {
            "level": "中",
            "award": 2700,
            "needexp": 270000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 3700,
            "needexp": 370000,
            "time": 18
        }
    },
    "聚元境": {
        "中": {
            "level": "中",
            "award": 8000,
            "needexp": 800000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 20600,
            "needexp": 2060000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 39000,
            "needexp": 3900000,
            "time": 24
        }
    },
    "归元境": {
        "中": {
            "level": "中",
            "award": 95800,
            "needexp": 9580000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 298000,
            "needexp": 29800000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 627800,
            "needexp": 62780000,
            "time": 24
        }
    },
    "通玄境": {
        "中": {
            "level": "中",
            "award": 1248800,
            "needexp": 124880000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 2880000,
            "needexp": 288000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 10988000,
            "needexp": 498800000,
            "time": 24
        }
    },
    "踏虚境": {
        "中": {
            "level": "中",
            "award": 50688800,
            "needexp": 5068880000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 70108880,
            "needexp": 7010888000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 98888000,
            "needexp": 9888800000,
            "time": 24
        }
    },
    "天人境": {
        "中": {
            "level": "中",
            "award": 168888000,
            "needexp": 168888800000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 198888000,
            "needexp": 44833200000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 228888000,
            "needexp": 67249800000,
            "time": 24
        }
    },
    "悟道境": {
        "中": {
            "level": "中",
            "award": 550000000,
            "needexp": 134499600000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 750000000,
            "needexp": 268999200000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 950000000,
            "needexp": 564898320000,
            "time": 24
        }
    },
    "炼神境": {
        "中": {
            "level": "中",
            "award": 1500000000,
            "needexp": 847347480000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 2000000000,
            "needexp": 1016816976000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 2500000000,
            "needexp": 1220180371000,
            "time": 24
        }
    },
    "逆虚境": {
        "中": {
            "level": "中",
            "award": 3000000000,
            "needexp": 1586234482000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 3500000000,
            "needexp": 1903481378000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 4000000000,
            "needexp": 2284177654000,
            "time": 24
        }
    },
    "合道境": {
        "中": {
            "level": "中",
            "award": 4500000000,
            "needexp": 3426266481000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 5000000000,
            "needexp": 4111519777000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 6000000000,
            "needexp": 5344975710000,
            "time": 24
        }
    },
    "虚劫境": {
        "中": {
            "level": "中",
            "award": 6500000000,
            "needexp": 8017463565000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 7500000000,
            "needexp": 10422702630000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 9000000000,
            "needexp": 13549513420000,
            "time": 24
        }
    },
    "羽化境": {
        "中": {
            "level": "中",
            "award": 10000000000,
            "needexp": 24217123420000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 11000000000,
            "needexp": 42384513420000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 12500000000,
            "needexp": 68540171640000,
            "time": 24
        }
    },
    "登仙境": {
        "中": {
            "level": "中",
            "award": 13500000000,
            "needexp": 109184274620000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 14000000000,
            "needexp": 124927000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 14500000000,
            "needexp": 138904000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 15500000000,
            "needexp": 205482000000000,
            "time": 60
        }
    },
    "真仙境": {
        "中": {
            "level": "中",
            "award": 15500000000,
            "needexp": 280105000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 16000000000,
            "needexp": 306664000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 17200000000,
            "needexp": 368291000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 18600000000,
            "needexp": 404255000000000,
            "time": 60
        }
    },
    "玄仙境": {
        "中": {
            "level": "中",
            "award": 19100000000,
            "needexp": 444251000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 21100000000,
            "needexp": 538126000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 21900000000,
            "needexp": 656141000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 23100000000,
            "needexp": 720660000000000,
            "time": 60
        }
    },
    "金仙境": {
        "中": {
            "level": "中",
            "award": 25500000000,
            "needexp": 788676000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 28000000000,
            "needexp": 935153000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 30000000000,
            "needexp": 1168970000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 33700000000,
            "needexp": 1327050000000000,
            "time": 60
        }
    },
    "太乙金": {
        "中": {
            "level": "中",
            "award": 50100000000,
            "needexp": 1426080000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 65900000000,
            "needexp": 1702070000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 75300000000,
            "needexp": 2064720000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 86700000000,
            "needexp": 2286090000000000,
            "time": 60
        }
    },
    "大罗金": {
        "中": {
            "level": "中",
            "award": 166000000000,
            "needexp": 2541180000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 215000000000,
            "needexp": 3213460000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 375000000000,
            "needexp": 4334520000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 451000000000,
            "needexp": 5437930000000000,
            "time": 60
        }
    },
    "九天玄": {
        "中": {
            "level": "中",
            "award": 654000000000,
            "needexp": 6763710000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 722000000000,
            "needexp": 8292030000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 793000000000,
            "needexp": 14091900000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 873000000000,
            "needexp": 16423300000000000,
            "time": 60
        }
    },
    "混元大": {
        "中": {
            "level": "中",
            "award": 1050000000000,
            "needexp": 18989900000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 1160000000000,
            "needexp": 24902200000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 1280000000000,
            "needexp": 28317400000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 1400000000000,
            "needexp": 36205300000000000,
            "time": 60
        }
    },
    "罗天上": {
        "中": {
            "level": "中",
            "award": 1410000000000,
            "needexp": 40338800000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 1690000000000,
            "needexp": 45322400000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 1870000000000,
            "needexp": 56852900000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 21600000000000,
            "needexp": 63496500000000000,
            "time": 60
        }
    },
    "无极仙": {
        "中": {
            "level": "中",
            "award": 24500000000000,
            "needexp": 81321300000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 27600000000000,
            "needexp": 91658300000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 35000000000000,
            "needexp": 103074000000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 49300000000000,
            "needexp": 144935000000000000,
            "time": 60
        }
    },
    "混沌仙": {
        "中": {
            "level": "中",
            "award": 56200000000000,
            "needexp": 165253000000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 63800000000000,
            "needexp": 212632000000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 81700000000000,
            "needexp": 240158000000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 103000000000000,
            "needexp": 304220000000000000,
            "time": 60
        }
    },
    "无极仙": {
        "中": {
            "level": "中",
            "award": 116000000000000,
            "needexp": 341375000000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 128000000000000,
            "needexp": 413188000000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 155000000000000,
            "needexp": 500085000000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 187000000000000,
            "needexp": 550156000000000000,
            "time": 60
        }
    },
    "神君境": {
        "中": {
            "level": "中",
            "award": 210000000000000,
            "needexp": 616251000000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 230000000000000,
            "needexp": 677064000000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 278000000000000,
            "needexp": 898377000000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 336000000000000,
            "needexp": 987334000000000000,
            "time": 60
        }
    },
    "神王境": {
        "中": {
            "level": "中",
            "award": 376000000000000,
            "needexp": 1104740000000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 412000000000000,
            "needexp": 1331490000000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 497000000000000,
            "needexp": 1605640000000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 600000000000000,
            "needexp": 1763520000000000000,
            "time": 60
        }
    },
    "神皇境": {
        "中": {
            "level": "中",
            "award": 670000000000000,
            "needexp": 1971850000000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 807000000000000,
            "needexp": 2163480000000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 973000000000000,
            "needexp": 2860450000000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 1070000000000000,
            "needexp": 3140470000000000000,
            "time": 60
        }
    },
    "神帝境": {
        "中": {
            "level": "中",
            "award": 1190000000000000,
            "needexp": 3509950000000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 1490000000000000,
            "needexp": 3849770000000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 1730000000000000,
            "needexp": 5085560000000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 1900000000000000,
            "needexp": 5582000000000000000,
            "time": 60
        }
    },
    "神尊境": {
        "中": {
            "level": "中",
            "award": 2120000000000000,
            "needexp": 6959870000000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 2370000000000000,
            "needexp": 7757450000000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 245377000000000,
            "needexp": 9294560000000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 269468000000000,
            "needexp": 10016300000000000000,
            "time": 60
        }
    },
    "无上至": {
        "中": {
            "level": "中",
            "award": 297538000000000,
            "needexp": 10808900000000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 327314000000000,
            "needexp": 11679400000000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 435627000000000,
            "needexp": 14857900000000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 479221000000000,
            "needexp": 16132800000000000000,
            "time": 60
        }
    },
    "鸿蒙掌": {
        "中": {
            "level": "中",
            "award": 527144000000000,
            "needexp": 17542300000000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 621718000000000,
            "needexp": 19089900000000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 771718000000000,
            "needexp": 24714800000000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 847326000000000,
            "needexp": 26984600000000000000,
            "time": 60
        }
    },
    "道神境": {
        "中": {
            "level": "中",
            "award": 933833000000000,
            "needexp": 29476700000000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 1129940000000000,
            "needexp": 38550500000000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 1503900000000000,
            "needexp": 50607500000000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 1819780000000000,
            "needexp": 60797400000000000000,
            "time": 60
        }
    },
    "道无涯": {
        "中": {
            "level": "中",
            "award": 2001820000000000,
            "needexp": 66674000000000000000,
            "time": 12
        },
        "难": {
            "level": "难",
            "award": 2202010000000000,
            "needexp": 73100000000000000000,
            "time": 18
        },
        "高难": {
            "level": "高难",
            "award": 2930680000000000,
            "needexp": 96576600000000000000,
            "time": 24
        },
        "超难": {
            "level": "超难",
            "award": 3223960000000000,
            "needexp": 106064000000000000000,
            "time": 60
        }
    }
}